# --- CLI essentials ---
brew "git"
brew "zsh"
brew "zinit"
brew "neovim"
brew "mise"
brew "direnv"
brew "zoxide"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "bat"
brew "eza"
brew "delta"
brew "lazygit"
brew "gnupg"
brew "pinentry-mac"
brew "vivid"

# --- GUI apps ---
cask "warp"
cask "orbstack"
cask "raycast"
cask "rectangle"

# Optional: if you use it
# cask "docker"

